GopalSaraf/Practicals/PSDL/include/proc/pic16f1764.inc
// Register: DAC3REF
#define DAC3REF DAC3REF
DAC3REF                                  equ 0598h
// bitfield definitions
DAC3REF_DACR_POSN                        equ 0000h
DAC3REF_DACR_POSITION                    equ 0000h
DAC3REF_DACR_SIZE                        equ 0005h
DAC3REF_DACR_LENGTH                      equ 0005h
DAC3REF_DACR_MASK                        equ 001Fh
DAC3REF_DACR0_POSN                       equ 0000h
DAC3REF_DACR0_POSITION                   equ 0000h
DAC3REF_DACR0_SIZE                       equ 0001h
DAC3REF_DACR0_LENGTH                     equ 0001h
DAC3REF_DACR0_MASK                       equ 0001h
DAC3REF_DACR1_POSN                       equ 0001h
DAC3REF_DACR1_POSITION                   equ 0001h
DAC3REF_DACR1_SIZE                       equ 0001h
DAC3REF_DACR1_LENGTH                     equ 0001h
DAC3REF_DACR1_MASK                       equ 0002h
DAC3REF_DACR2_POSN                       equ 0002h
DAC3REF_DACR2_POSITION                   equ 0002h
DAC3REF_DACR2_SIZE                       equ 0001h
DAC3REF_DACR2_LENGTH                     equ 0001h
DAC3REF_DACR2_MASK                       equ 0004h
DAC3REF_DACR3_POSN                       equ 0003h
DAC3REF_DACR3_POSITION                   equ 0003h
DAC3REF_DACR3_SIZE                       equ 0001h
DAC3REF_DACR3_LENGTH                     equ 0001h
DAC3REF_DACR3_MASK                       equ 0008h
DAC3REF_DACR4_POSN                       equ 0004h
DAC3REF_DACR4_POSITION                   equ 0004h
DAC3REF_DACR4_SIZE                       equ 0001h
DAC3REF_DACR4_LENGTH                     equ 0001h
DAC3REF_DACR4_MASK                       equ 0010h
DAC3REF_R0_POSN                          equ 0000h
DAC3REF_R0_POSITION                      equ 0000h
DAC3REF_R0_SIZE                          equ 0001h
DAC3REF_R0_LENGTH                        equ 0001h
DAC3REF_R0_MASK                          equ 0001h
DAC3REF_R1_POSN                          equ 0001h
DAC3REF_R1_POSITION                      equ 0001h
DAC3REF_R1_SIZE                          equ 0001h
DAC3REF_R1_LENGTH                        equ 0001h
DAC3REF_R1_MASK                          equ 0002h
DAC3REF_R2_POSN                          equ 0002h
DAC3REF_R2_POSITION                      equ 0002h
DAC3REF_R2_SIZE                          equ 0001h
DAC3REF_R2_LENGTH                        equ 0001h
DAC3REF_R2_MASK                          equ 0004h
DAC3REF_R3_POSN                          equ 0003h
DAC3REF_R3_POSITION                      equ 0003h
DAC3REF_R3_SIZE                          equ 0001h
DAC3REF_R3_LENGTH                        equ 0001h
DAC3REF_R3_MASK                          equ 0008h
DAC3REF_R4_POSN                          equ 0004h
DAC3REF_R4_POSITION                      equ 0004h
DAC3REF_R4_SIZE                          equ 0001h
DAC3REF_R4_LENGTH                        equ 0001h
DAC3REF_R4_MASK                          equ 0010h
DAC3REF_DAC3R_POSN                       equ 0000h
DAC3REF_DAC3R_POSITION                   equ 0000h
DAC3REF_DAC3R_SIZE                       equ 0005h
DAC3REF_DAC3R_LENGTH                     equ 0005h
DAC3REF_DAC3R_MASK                       equ 001Fh
DAC3REF_DAC3R0_POSN                      equ 0000h
DAC3REF_DAC3R0_POSITION                  equ 0000h
DAC3REF_DAC3R0_SIZE                      equ 0001h
DAC3REF_DAC3R0_LENGTH                    equ 0001h
DAC3REF_DAC3R0_MASK                      equ 0001h
DAC3REF_DAC3R1_POSN                      equ 0001h
DAC3REF_DAC3R1_POSITION                  equ 0001h
DAC3REF_DAC3R1_SIZE                      equ 0001h
DAC3REF_DAC3R1_LENGTH                    equ 0001h
DAC3REF_DAC3R1_MASK                      equ 0002h
DAC3REF_DAC3R2_POSN                      equ 0002h
DAC3REF_DAC3R2_POSITION                  equ 0002h
DAC3REF_DAC3R2_SIZE                      equ 0001h
DAC3REF_DAC3R2_LENGTH                    equ 0001h
DAC3REF_DAC3R2_MASK                      equ 0004h
DAC3REF_DAC3R3_POSN                      equ 0003h
DAC3REF_DAC3R3_POSITION                  equ 0003h
DAC3REF_DAC3R3_SIZE                      equ 0001h
DAC3REF_DAC3R3_LENGTH                    equ 0001h
DAC3REF_DAC3R3_MASK                      equ 0008h
DAC3REF_DAC3R4_POSN                      equ 0004h
DAC3REF_DAC3R4_POSITION                  equ 0004h
DAC3REF_DAC3R4_SIZE                      equ 0001h
DAC3REF_DAC3R4_LENGTH                    equ 0001h
DAC3REF_DAC3R4_MASK                      equ 0010h
DAC3REF_REF0_POSN                        equ 0000h
DAC3REF_REF0_POSITION                    equ 0000h
DAC3REF_REF0_SIZE                        equ 0001h
DAC3REF_REF0_LENGTH                      equ 0001h
DAC3REF_REF0_MASK                        equ 0001h
DAC3REF_REF1_POSN                        equ 0001h
DAC3REF_REF1_POSITION                    equ 0001h
DAC3REF_REF1_SIZE                        equ 0001h
DAC3REF_REF1_LENGTH                      equ 0001h
DAC3REF_REF1_MASK                        equ 0002h
DAC3REF_REF2_POSN                        equ 0002h
DAC3REF_REF2_POSITION                    equ 0002h
DAC3REF_REF2_SIZE                        equ 0001h
DAC3REF_REF2_LENGTH                      equ 0001h
DAC3REF_REF2_MASK                        equ 0004h
DAC3REF_REF3_POSN                        equ 0003h
DAC3REF_REF3_POSITION                    equ 0003h
DAC3REF_REF3_SIZE                        equ 0001h
DAC3REF_REF3_LENGTH                      equ 0001h
DAC3REF_REF3_MASK                        equ 0008h
DAC3REF_REF4_POSN                        equ 0004h
DAC3REF_REF4_POSITION                    equ 0004h
DAC3REF_REF4_SIZE                        equ 0001h
DAC3REF_REF4_LENGTH                      equ 0001h
DAC3REF_REF4_MASK                        equ 0010h
DAC3REF_REF5_POSN                        equ 0005h
DAC3REF_REF5_POSITION                    equ 0005h
DAC3REF_REF5_SIZE                        equ 0001h
DAC3REF_REF5_LENGTH                      equ 0001h
DAC3REF_REF5_MASK                        equ 0020h
DAC3REF_DAC3REF0_POSN                    equ 0000h
DAC3REF_DAC3REF0_POSITION                equ 0000h
DAC3REF_DAC3REF0_SIZE                    equ 0001h
DAC3REF_DAC3REF0_LENGTH                  equ 0001h
DAC3REF_DAC3REF0_MASK                    equ 0001h
DAC3REF_DAC3REF1_POSN                    equ 0001h
DAC3REF_DAC3REF1_POSITION                equ 0001h
DAC3REF_DAC3REF1_SIZE                    equ 0001h
DAC3REF_DAC3REF1_LENGTH                  equ 0001h
DAC3REF_DAC3REF1_MASK                    equ 0002h
DAC3REF_DAC3REF2_POSN                    equ 0002h
DAC3REF_DAC3REF2_POSITION                equ 0002h
DAC3REF_DAC3REF2_SIZE                    equ 0001h
DAC3REF_DAC3REF2_LENGTH                  equ 0001h
DAC3REF_DAC3REF2_MASK                    equ 0004h
DAC3REF_DAC3REF3_POSN                    equ 0003h
DAC3REF_DAC3REF3_POSITION                equ 0003h
DAC3REF_DAC3REF3_SIZE                    equ 0001h
DAC3REF_DAC3REF3_LENGTH                  equ 0001h
DAC3REF_DAC3REF3_MASK                    equ 0008h
DAC3REF_DAC3REF4_POSN                    equ 0004h
DAC3REF_DAC3REF4_POSITION                equ 0004h
DAC3REF_DAC3REF4_SIZE                    equ 0001h
DAC3REF_DAC3REF4_LENGTH                  equ 0001h
DAC3REF_DAC3REF4_MASK                    equ 0010h
DAC3REF_DAC3REF5_POSN                    equ 0005h
DAC3REF_DAC3REF5_POSITION                equ 0005h
DAC3REF_DAC3REF5_SIZE                    equ 0001h
DAC3REF_DAC3REF5_LENGTH                  equ 0001h
DAC3REF_DAC3REF5_MASK                    equ 0020h

